In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({
    "Name": ["Alice", "Bob", "Charlie", "David", "Eve"],
    "Age": [25, 32, 22, 35, 47],
    "Score": [85, 63, 77, 96, 54]
})

In [3]:
df

      Name  Age  Score
0    Alice   25     85
1      Bob   32     63
2  Charlie   22     77
3    David   35     96
4      Eve   47     54

In [5]:
my_df = pd.read_csv('my_df.csv', index_col=0)

In [6]:
my_df

          Quantity   Color  Price_per_kg
Apples          20     Red             3
Bananas         30  Yellow             2
Cherries        15     Red             4
Dates           10   Brown             5

In [ ]:
my_df.head(2)